# Лабораторная работа #2

## Вступление

Вам предстоит выполнить 10 заданий: написать код под каждое

## Работа

### Задание 1
Напишите программу, выводящую на экран таблицу,
содержащую минимальные и максимальные значения для всех простых
числовых типов

```java
import java.util.Arrays;
import java.util.LinkedHashMap;
import java.util.List;
import java.util.Map;

public class Main {
    public static void main(String[] args) {
        Map<String, List<String>> types = new LinkedHashMap<String, List<String>>() {{
            put("byte", Arrays.asList("8 бит", "-128", "127"));
            put("short", Arrays.asList("16 бит", "-32768", "32767"));
            put("int", Arrays.asList("32 бит", "-2147483648", "2147483647"));
            put("long", Arrays.asList("64 бит", "-9223372036854775808", "9223372036854775807"));
            put("float", Arrays.asList("32 бит", "1.4e-45", "3.4028235e+38"));
            put("double", Arrays.asList("64 бит", "4.9e-324", "1.7976931348623157e+308"));
        }};

        System.out.println("Простые числовые типы Java\n");
        System.out.println("Тип" + " \tВместимость" + "\tДиапазон значений");
        
        for (Map.Entry<String, List<String>> entry : types.entrySet()) {
            String key = entry.getKey();
            String capacity = entry.getValue().get(0);
            String min = entry.getValue().get(1);
            String max = entry.getValue().get(2);

            System.out.println(key + " \t(" + capacity + ") " + "\tот " + min + " до " + max + ".");
        }
    }
}
```

##### Вывод:
```bash
Простые числовые типы Java

Тип 	Вместимость	Диапазон значений
byte 	(8 бит) 	от -128 до 127.
short 	(16 бит) 	от -32768 до 32767.
int 	(32 бит) 	от -2147483648 до 2147483647.
long 	(64 бит) 	от -9223372036854775808 до 9223372036854775807.
float 	(32 бит) 	от 1.4e-45 до 3.4028235e+38.
double 	(64 бит) 	от 4.9e-324 до 1.7976931348623157e+308.
```
##### Несколько слов по коду:

Здесь я создаю переменную `types` типа `Map<String, List<String>>` - т.е она может хранить словарь, где ключ - строка, а значение список строк. 
далее присваиваю переменной значение `new LinkedHashMap<String, List<String>>()` сразу добавляю все значения которые я хочу.

Замечание: почему `LinkedHashMap`? Потому что `HashMap`, как и многие другие реализации интерфейса Map, не гарантирует сохранение порядка элементов, 
а `LinkedHashMap` сохраняет порядок элементов в порядке их добавления в `Map`.

Далее могут возникнуть вопросы за красивую табуляцию(пробелы между строк в выводе), за что отвечает обычный спецсимвол стандарта POSIX: `\t`, 
который и делает такую красивую табуляцию.

### Задание 2
Дан массив из 20 целых переменных. Конкретные значения
для элементов задаются в конструкции инициализации. Найти среднее
геометрическое отрицательных элементов.

```java
public class task2 {
    public static void main(String[] args) {
        int[] array = {1, 2, 3, 4, -5, 6, 7, 8, -9, 10, -11, -12, -13, -14, -15, 16, 17, -18, 20, -22};

        int multiply = 1;
        int count = 0;

        for (int element : array) {
            if (element < 0) {
                multiply *= element;
                count++;
            }
        }

        if (count > 0 && count % 2 != 0 && multiply != 0) {
            double geometricMean = -Math.pow(Math.abs(multiply), 1.0 / count);
            System.out.println("Среднее геометрическое элементов: " + geometricMean);
        } else {
            System.out.println("Невозможно определить СГ: четное количество элементов");
        }
    }
}
```
##### Вывод
```bash
Среднее геометрическое элементов: -10.87453314657656
```

PS: Вообще стоит подумать о законности выражения `Найти среднее
геометрическое отрицательных элементов`, ибо с точки зрения математики - всё спорно.

### Задание 3
Радар посылает сигнал, ловит его отражение и по времени
распространения сигнала определяет расстояние до предмета. Есть
некоторое расстояние R. Сигнал от предметов, расположенных на
больших расстояниях слишком слабый и радар не может обнаружить их
обнаружить. Радар используется для охраны некоторого объекта.
Определено расстояние r меньшее R. Если какой-то предмет
оказывается слишком близко к объекту охраны, на расстоянии меньшем
r, объявляется тревога. Даны (заданы в самой функции main)
координаты (два вещественных значения) некоторого предмета в
окрестности объекта (в Декартовой прямоугольной системе координат).
Определить и вывести на экран сообщение: если предмет далеко - "Не
обнаружен", если на расстоянии большем r, но меньшем или равном R
- "Обнаружен", если на расстоянии меньшем или равном r - "Тревога".

### Задание 4
Преобразуйте предыдущую программу так, чтобы можно
было задавать расстояния R и r, координаты предмета через командную
строку. Протестируйте программу для всех возможных вариантов
попадания точки.

### Задание 5
Напишите программу, получающую через командную
строку целое десятичное число и отображающую на экране само это
число и его представление в двоичной, восьмеричной и
шестнадцатеричной системах счисления.

### Задание 6
В стандарте Unicode-16 под знаки Кириллицы (включая
символы украинского, сербского, македонского и т.д. языков, а также
старославянского) отведен диапазон кодов 0x0400 - 0x04FF. Создайте
метод для отображения в виде таблицы непрерывного набора Unicode
символов, которому через аргументы передаются стартовый код, число
выводимых строк и столбцов таблицы. Напишите программу, которая
использует метод для вывода символов Кириллицы (стартовый код
0x0400, 16 строк, 16 столбцов, а, затем, для вывода некоторых знаков
денежных единиц (например, бразильского крузейро, индийской рупии,
евро, гривны, турецкой лиры, рубля, биткоина), стартовый код 0x20a0, 2
строки, 16 столбцов. Нужно получить что-то подобное следующему
```
 0 1 2 3 4 5 6 7 8 9 a b c d e f
400 Ѐ Ё Ђ Ѓ Є Ѕ І Ї Ј Љ Њ Ћ Ќ Ѝ Ў Џ
410 А Б В Г Д Е Ж З И Й К Л М Н О П
420 Р С Т У Ф Х Ц Ч Ш Щ Ъ Ы Ь Э Ю Я
430 а б в г д е ж з и й к л м н о п
440 р с т у ф х ц ч ш щ ъ ы ь э ю я
450 ѐ ё ђ ѓ є ѕ і ї ј љ њ ћ ќ ѝ ў џ
460 Ѡ ѡ Ѣ ѣ Ѥ ѥ Ѧ ѧ Ѩ ѩ Ѫ ѫ Ѭ ѭ Ѯ ѯ
470 Ѱ ѱ Ѳ ѳ Ѵ ѵ Ѷ ѷ Ѹ ѹ Ѻ ѻ Ѽ ѽ Ѿ ѿ
480 Ҁ ҁ ҂ ҃ ҄ ҅ ҆ ҇ ҈ ҉ Ҋ ҋ Ҍ ҍ Ҏ ҏ
490 Ґ ґ Ғ ғ Ҕ ҕ Җ җ Ҙ ҙ Қ қ Ҝ ҝ Ҟ ҟ
4a0 Ҡ ҡ Ң ң Ҥ ҥ Ҧ ҧ Ҩ ҩ Ҫ ҫ Ҭ ҭ Ү ү
4b0 Ұ ұ Ҳ ҳ Ҵ ҵ Ҷ ҷ Ҹ ҹ Һ һ Ҽ ҽ Ҿ ҿ
4c0 Ӏ Ӂ ӂ Ӄ ӄ Ӆ ӆ Ӈ ӈ Ӊ ӊ Ӌ ӌ Ӎ ӎ ӏ 
4d0 Ӑ ӑ Ӓ ӓ Ӕ ӕ Ӗ ӗ Ә ә Ӛ ӛ Ӝ ӝ Ӟ ӟ
4e0 Ӡ ӡ Ӣ ӣ Ӥ ӥ Ӧ ӧ Ө ө Ӫ ӫ Ӭ ӭ Ӯ ӯ
4f0 Ӱ ӱ Ӳ ӳ Ӵ ӵ Ӷ ӷ Ӹ ӹ Ӻ ӻ Ӽ ӽ Ӿ ӿ
 0 1 2 3 4 5 6 7 8 9 a b c d e f
20a0 ₠ ₡ ₢ ₣ ₤ ₥ ₦ ₧ ₨ ₩ ₪ ₫ € ₭ ₮ ₯
20b0 ₰ ₱ ₲ ₳ ₴ ₵ ₶ ₷ ₸ ₹ ₺ ₻ ₼ ₽ ₾ ₿
```
Чтобы символы отображались в консольном окне, нужно, чтобы кодировка
символов и в текстовом редакторе, в котором набирается текст программы и
кодировка символов в терминале (консольном окне) использовали стандарт
Unicode. В MS Visual Studio Code и IntelliJ Idea это настройки по умолчанию.
Чтобы добиться этого в Eclipse нужно выполнить следующее: Window -
Preferences - General - Workspace - Text file encoding (установить UTF-8)

### Задание 7
Написать приложение для реализации следующего
алгоритма: дана строка, посчитать и вывести на экран следующие
значения: количество букв, сколько из них строчных, сколько прописных,
количество цифр, сколько из них арабских, сколько не арабских,
количество других символов и общее количество всех символов.

### Задание 8
Используйте справочную систему Java для того, чтобы
разобраться с тем, как использовать методы `indexOf` класса *String*.

### Задание 9
Используйте методы `indexOf` класса *String* для решения и
программной реализации следующей задачи. Посчитать, сколько раз
заданная подстрока встречается в указанной строке.

### Задание 10
Напишите программу для решения следующей задачи.
Дана строка. Найти все ее циклические перестановки. Например, для
строки “abcd” это строки “abcd”, “bcda”, “cdab”, “dabc”.


*Авторство: **Бояршинов Н.О***
